prefeitura/app/controllers/colaborators_controller.rb

SELECT "colaborators".* FROM "colaborators"
---
  def index
    @colaborators = Colaborator.all

INSERT INTO "colaborators" ("name", "age", "salary", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Zezim"], ["age", 20], ["salary", 3000.0], ["created_at", "2016-05-23 13:20:49.362953"], ["updated_at", "2016-05-23 13:20:49.362953"]]
---
  def create
    @colaborator = Colaborator.create(colaborator_params)

UPDATE "colaborators" SET "age" = ?, "updated_at" = ? WHERE "colaborators"."id" = ?  [["age", 20], ["updated_at", "2016-05-23 14:15:43.897130"], ["id", 1]]
---
  def update
      if @colaborator.update(colaborator_params)

DELETE FROM "colaborators" WHERE "colaborators"."id" = ?  [["id", 1]]
---
  def destroy
    respond_with @colaborator.destroy

SELECT  "colaborators".* FROM "colaborators" WHERE "colaborators"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_colaborator
      @colaborator = Colaborator.find(params[:id])